# 4-2. Представлен список чисел. Необходимо вывести элементы исходного списка, значения которых больше предыдущего элемента.

orig_list = [300, 2, 12, 44, 1, 1, 4, 10, 7, 1, 78, 123, 55] #исходный список

def f_gen(my_list): #создаем фенкцию генератор
    prev_el = 0 #это буде пред идущий элемент
    for el in my_list: #цикл по исходному списку
        if(el > prev_el):
            yield el
        prev_el =el

a = f_gen(orig_list)

for i in a:  #! тут проблема с формированием списка(
    print(i)

