# 4-4. Представлен список чисел. Определить элементы списка, не имеющие повторений. Сформировать итоговый массив чисел, соответствующих требованию.
# Элементы вывести в порядке их следования в исходном списке. Для выполнения задания обязательно использовать генератор.
# Пример исходного списка: [2, 2, 2, 7, 23, 1, 44, 44, 3, 2, 10, 7, 4, 11].
# Результат: [23, 1, 3, 10, 4, 11]

orig_list = [2, 2, 2, 7, 23, 1, 44, 44, 3, 2, 10, 7, 4, 11] #исходный список
new_list = []

for val in orig_list: #"Пробегаем" исходный списко
    indices = [i for i, x in enumerate(orig_list) if x == val] # и по каждому значению получаем список индексов вхождения элемента
    if len(indices) == 1: # если вхождение одно, то мы добавляем элемент в new_list
        new_list.append(val)

print(f"Исходный спискок: {orig_list}")
print(f"Результат: {new_list}")
