# 4-6. Реализовать два небольших скрипта:
# а) итератор, генерирующий целые числа, начиная с указанного,
# б) итератор, повторяющий элементы некоторого списка, определенного заранее.
# Подсказка: использовать функцию count() и cycle() модуля itertools.
# Обратите внимание, что создаваемый цикл не должен быть бесконечным. Необходимо предусмотреть условие его завершения.
# Например, в первом задании выводим целые числа, начиная с 3, а при достижении числа 10 завершаем цикл.
# Во втором также необходимо предусмотреть условие, при котором повторение элементов списка будет прекращено.

#1
from itertools import count

for el in count(5):
    if el > 50:
        break
    else:
        print(el)

#2
from itertools import cycle

orig_list = [300, 2, 12, 44, 1, 1, 4, 10, 7, 1, 78, 123, 55] #для примера берем список из второй задачи
count_list = len(orig_list) #кол-во элементов в списке

с = 1
for el in cycle(orig_list):
    if с > count_list:
        break
    print(el)
    с += 1