# 6-1. Создать класс TrafficLight (светофор) и определить у него один атрибут color (цвет) и метод running (запуск). Атрибут реализовать как приватный.
# В рамках метода реализовать переключение светофора в режимы: красный, желтый, зеленый.
# Продолжительность первого состояния (красный) составляет 7 секунд, второго (желтый) — 2 секунды, третьего (зеленый) — на ваше усмотрение.
# Переключение между режимами должно осуществляться только в указанном порядке (красный, желтый, зеленый). Проверить работу примера, создав экземпляр и вызвав описанный метод.
import time

class TrafficLight:
    __color = {"красный": 7, "желтый": 2, "зеленый": 4}
    pause = 0

    def running(self):
        color_dict = self.__color
        for key, el in enumerate(color_dict):
            pause = color_dict.get(el)
            print(f"{el} горит {pause} секунды")
            time.sleep(pause)


TrafficLight().running()
